rottenpotatoes/app/controllers/movies_controller.rb

  def dsearch
    if params[:id].eql? nil; redirect_to "/movies"; return ; end
    @movie = Movie.find(params[:id])
    if @movie.director.eql? "" or @movie.director.nil?; redirect_to "/movies"; return ; end
    @movies = Movie.where( :director => @movie.director )
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 11]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "a"]]

  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'hilite'
    when 'rating'
      ordering,@rating_header = {:rating => :asc}, 'hilite'
    when 'director'
      ordering,@director_header = {:director=> :asc}, 'hilite'
    when 'description'
      ordering,@description_header = {:title=> :asc}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R')  ORDER BY "movies"."rating" ASC

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sdas"], ["rating", "PG"], ["created_at", "2018-10-01 04:48:45.647209"], ["updated_at", "2018-10-01 04:48:45.647209"]]